{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "المجموعة \"%1$s\" مستخدمة في تطبيق \"المجموعات التلقائية\" Auto Groups و لا يمكن حذفها",
    "Auto Groups" : "مجموعات تلقائية",
    "Automatically adds all users to one or multiple specified groups." : "يُضيف كل المستخدمين لمجموعة مُحدّدة أو أكثر بصورةٍ تلقائيةٍ.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Settings > Administration > Additional settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "يُضيف كل المستخدمين  بصورةٍ تلقائيةٍ للمجموعات التلقائية Auto Groups المُحدّدة عدا المستخدمين المنتمين إلى أحد المجموعات المُستثناة. \nيٌمكن اختياريّاً إطلاق عملية إضافة المستخدمين للمجموعات عقب كل عملية دخول ناجح؛ الأمر الذي يُعدّ مفيداً لخوادم المستخدمين الخارجيين. \n\n## التهيئةى\n\n- إذهب إلى  \"Settings > Administration > Additional settings\"\n- إضبط خيارات المجموعات التلقائية\n- إذا كان هنالك داعٍ، يُمكنك أيضاً تعيين المجموعات المُستثناة (و التي قد يكون منها على سبيل المثال Sevice Accounts).\n- يُمكنك اختيارياً تعيين \"حطّاف الدخول\" Login Hook ليتم فرض العضوية الصحيحة في المجموعات عقب كل عملية دخول ناجح"
},"pluralForm" :"nplurals=6; plural=n==0 ? 0 : n==1 ? 1 : n==2 ? 2 : n%100>=3 && n%100<=10 ? 3 : n%100>=11 && n%100<=99 ? 4 : 5;"
}