{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "المجموعة \"%1$s\" مستخدمة في تطبيق \"المجموعات التلقائية\" Auto Groups و لا يمكن حذفها",
    "Auto Groups" : "مجموعات تلقائية",
    "Automatically adds all users to one or multiple specified groups." : "يُضيف كل المستخدمين لمجموعة مُحدّدة أو أكثر بصورةٍ تلقائيةٍ.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Settings > Administration > Additional settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "يُضيف كل المستخدمين  بصورةٍ تلقائيةٍ للمجموعات التلقائية Auto Groups المُحدّدة عدا المستخدمين المنتمين إلى أحد المجموعات المُستثناة. \nيٌمكن اختياريّاً إطلاق عملية إضافة المستخدمين للمجموعات عقب كل عملية دخول ناجح؛ الأمر الذي يُعدّ مفيداً لخوادم المستخدمين الخارجيين. \n\n## التهيئة\n- إذهب إلى  \"Settings > Administration > Additional settings\"\n- إضبط خيارات المجموعات التلقائية\n- إذا كان هنالك داعٍ، يُمكنك أيضاً تعيين المجموعات المُستثناة (و التي قد يكون منها على سبيل المثال Sevice Accounts).\n- يُمكنك اختيارياً تعيين \"حطّاف الدخول\" Login Hook ليتم فرض العضوية الصحيحة في المجموعات عقب كل عملية دخول ناجح.\n\nلاحظ: أن هذا التطبيق سيمنع حذف أيٍّ من المجموعات التلقائية أو المُستثناة.\n\n## مُقارنة هذه التطبيق مع تطبيقات أخرى مُشابهة:\n\nالتطبيق   [Everyone Group] الموجود في \"Everyone:(https://apps.nextcloud.com/apps/group_everyone)\" يُضيف مجموعة افتراضية على الخادوم تضم جميع المستخدمين؛ بينما تطبيق \"Auto Groups\" يعمل على مجموعات حقيقية اعتيادية على الخادوم؛ (مع الخيار في تعيين مجموعات مستثناة يُستثنى مستخدموها من الإضافة إلى المجموعات التلقائية.)\n\nالتطبيق [Default Group] الموجود في \"(https://apps.nextcloud.com/apps/defaultgroup)\". تطبيق المجموعات التلقائية Auto Group هو تطوير لتطبيق Default Group الذي توقّف تطويره منذ الإصدار NC12. و  يمكن اعتبار التطبيقين متماثلان تقريبا من الناحية الوظيفية.\n\nملاحظة: من المخطط له إضافة بعض المزايا الإضافية لهذا التطبيق؛ منها: \"جمع المجموعات\" Union Group. للمزيد، أنظر: [Milestone Plans](https://github.com/stjosh/auto_groups/milestones)  ",
    "Automatically add all users to these groups." : "إضافة كل المستخدمين تلقائيّاً إلى تلك المجموعات.",
    "Override Groups:" : "استثناء المجموعات:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "المستخدمون الأعضاء في مجموعة واحدة على الأقل من تلك المجموعات سيتم إلغاؤهم من المجموعات التلقائية. و هذا ينطبق في حالة إضافة المستخدم لواحدة من تلك المجموعات بعد الإنشاء. بمعنى أنه تتم مراجعة العضوية في المجموعات المستثناة بعد كل تعديل في المجموعة.",
    "Set Auto Group membership on user creation." : "تعيين عضويته في المجموعات الآلية عند إنشاء المستخدم",
    "If checked, Auto Group membership will be enforced on user creation." : "إذا كانت مُفعّلة، عضوية المجموعات الآلية سيتم فرضها عند إنشاء المستخدم.",
    "Check Auto Group membership on modification of a user's groups." : "مراجعة عضوية المجموعات الآلية عند كل تعديل في مجموعات المستخدم.",
    "If checked, Auto Group membership will be re-enforced for a user account every time it is added to or removed from a group." : "إذا كانت مُفعّلة، عضوية المجموعات الآلية سيتم فرضها عند كل إضافة أو إلغاء للمستخدم من عضوية أي مجموعة.",
    "Check for correct Auto Group membership on every login." : "راجع صحة عضوية المجموعات الآلية عند كل دخول.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "مكّن هذا الخيار لفرض العضوية المناسبة للمجموعات الآلية عقب كل دخول ناجح. هذا الترتيب مفيد في حالة أن مستخدماً ما كان مُنشأً خارج نكست كلاود (أي مستخدم خارجي)، و كذلك لفرض عضوية المجموعات الصحيحة لكل المستخدمين عند تعديل المجموعات المستثناة للمجموعات الآلية."
},"pluralForm" :"nplurals=6; plural=n==0 ? 0 : n==1 ? 1 : n==2 ? 2 : n%100>=3 && n%100<=10 ? 3 : n%100>=11 && n%100<=99 ? 4 : 5;"
}