{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Група „%1$s“ се използва в приложението Auto Groups и не може да бъде изтрита.",
    "Auto Groups" : "Auto Groups",
    "Automatically adds all users to one or multiple specified groups." : "Автоматично добавя всички потребители към една или няколко посочени групи.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Автоматично добавя потребители към посочените автоматични групи, с изключение на тези потребители, принадлежащи към една от посочените групи за отмяна. \nПо избор присвояването на група може да се задейства при всяко успешно влизане, което е полезно за външни потребителски сървъри.\n\n## Конфигурация\n\n-  Отидете на „Настройки на администратора >Допълнителни настройки“\n- Конфигуриране на Auto Groups/Автоматични Групи/\n- Ако е необходимо, конфигурирайте Override Groups/Групи за Отмяна/ (напр. за Профили за Услуги)\n- По желание активирайте Кука за Влизане, която ще наложи правилното членство в групата при всяко успешно влизане\n\nОбърнете внимание, че това приложение предотвратява изтриването на групи за групи, посочени като Auto Groups или Override Groups.\n\n##  Сравнение с подобни приложения\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): Приложението „Everyone Group“ добавя виртуален групов сървър,  връщащ винаги всички потребители. За разлика от тях,, „Auto Groups“ работи с „истински“ групи в нормалния ви групов сървър. Освен това е възможно да се посочат Override Groups които да предотвратят добавянето на потребители към Auto Group(и).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): „Auto Groups\" всъщност е модернизирано и поддържано Fork копие на „Default Group“, която изглежда изоставена след NC12 или е така. Що се отнася до функционалност, те са почти идентични.\n\nОсвен това смятам да добавя още някои функции с течение на времето, например „Union Groups“ - вижте the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) за повече подробности.",
    "Auto Groups:" : "Auto Groups /Автоматични групи/:",
    "Automatically add all users to these groups." : "Автоматично добавяне на всички потребители към тези групи.",
    "Override Groups:" : "Override Groups /Групи за Замяна/:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Потребителите, които са членове на поне една от тези групи, се премахват от автоматичните групи. Такъв е и случаят, ако потребителят е добавен към една от тези групи след създаването, т.е. членството в групите за замяна се проверява след всяка промяна на групата.",
    "Check for correct Auto Group membership on every login." : "Проверявайте за правилното членство в Auto Group при всяко влизане.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Активирайте тази настройка, за да наложите правилното членство в Auto Group при всяко успешно влизане. Това е полезно, ако/или потребителите не са създадени в Nextcloud (напр. С външни потребителски сървъри), или за налагане на правилно членство в група за всички потребители, когато Auto Groups /Override Groups са се променили.",
    "Only check for Auto Group membership on user creation." : "Проверка за членство в Auto Group само при създаване на потребител.",
    "If checked, Auto Group membership will not be re-enforced on subsequent user modifications." : "Ако е отметнато, членството в Auto Group няма да бъде наложено отново при последващи потребителски модификации."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}