{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Die Gruppe \"%1$s\" wird in der Autogruppen App verwendet und kann nicht gelöscht werden.",
    "Auto Groups" : "Autogruppen",
    "Automatically adds all users to one or multiple specified groups." : "Fügt alle Benutzer automatisch einer oder mehreren konfigurierbaren Gruppen hinzu.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Fügt alle Benutzer automatisch zu den ausgewählten Autogruppen hinzu, es sei denn, der Benutzer gehört zu einer der konfigurierten Überschreibungsgruppen.\nOptional kann die korrekte Gruppenzugehörigkeit bei jeder erfolgreichen Anmeldung sichergestellt werden.\n\n## Konfiguration\n\n- Navigiere zu \"Admin Einstellungen > Zusätzliche Einstellungen\"\n- Autogruppen konfigurieren\n- Falls benötigt Überschreibungsgruppen konfigurieren (z.B. für Maschinenkonten)\n- Optional die Sicherstellung der korrekten Gruppenzugehörigkeit bei jedem Login aktivieren\n\nDiese App verhindert die Löschung von Gruppen, welche als Autogruppen oder Überschreibungsgruppen konfiguriert sind.\n\n## Vergleich zu ähnlichen Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): Die \"Everyone Group\" App erstellt ein virtuellen Gruppe, während \"Autogruppen\" auf Ihren \"normalen\" Gruppen arbeitet. Zusätzlich können Überschreibungsgruppen konfiguriert werden, welche das Hinzufügen zu den Autogruppen verhindert.\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Autogruppen\" ist eine modernisierte Version der \"Default Group\" App, welche seit NC12 nicht mehr gepflegt wird. \"Autogruppen\" bietet momentan fast die gleiche Funktionalität wie \"Default Group\".\n\nWeiter plane ich, in Zukunft neue Funktionen hinzuzufügen, z.B. \"Sammelgruppen\" - weitere Details im [Meilensteinplan](https://github.com/stjosh/auto_groups/milestones).",
    "Auto Groups:" : "Autogruppen:",
    "Automatically add all users to these groups." : "Alle Benutzer automatisch zu diesen Gruppen hinzufügen.",
    "Override Groups:" : "Überschreibungsgruppen:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Benutzer, welche zu mindestens einer dieser Gruppen gehören, werden aus den Autogruppen entfernt. Dies wird auch sichergestellt wenn der Benutzer erst nachträglich zu einer Überschreibungsgruppen hinzugefügt wird, d.h., die Gruppenzugehörigkeit wird nach jeder Gruppenmodifikation eines Benutzers überprüft.",
    "Check for correct Auto Group membership on every login." : "Zugehörigkeit zu den Autogruppen bei jeder Anmeldung überprüfen.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Diese Einstellung aktivieren um die korrekte Zugehörigkeit bei jeder erfolgreichen Anmeldung sicherzustellen. Dies ist nützlich falls die Benutzer nicht in Nextcloud erstellt werden (z.B. mit externen Benutzeranwendungen) oder um die korrekte Zugehörigkeit für alle Benutzer sicherzustellen, falls die Auto- oder Überschreibungsgruppen sich nachträglich geändert haben."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}