{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Η ομάδα \"%1$s\" χρησιμοποιείται από την εφαρμογή Αυτόματες Ομάδες και δεν μπορεί να διαγραφεί.",
    "Auto Groups" : "Αυτόματες Ομάδες",
    "Automatically adds all users to one or multiple specified groups." : "Αυτόματη προσθήκη όλων των χρηστών σε μία ή περισσότερες ομάδες.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Αυτόματη προσθήκη χρηστών σε ομάδες, εκτός αυτών που ανήκουν μια από τις εξαιρούμενες ομάδες. \nΠροαιρετικά, η προσθήκη σε ομάδα μπορεί να πραγματοποιηθεί σε όλες τις συνδέσεις, κάτι χρήσιμο για συνδέσεις εξωτερικών χρηστών.\n\nΛάβετε υπόψη ότι η εφαρμογή αποτρέπει τη διαγραφή ομάδων που αναφέρονται ως αυτόματες ομάδες ή εξαιρούμενες ομάδες.\n\n## Ρυθμίσεις\n\n- Από τις \"Ρυθμίσεις διαχειριστή > Επιπρόσθετες ρυθμίσεις\"\n- Ρυθμίστε το Αυτόματες\n- Εάν απαιτείται, ρυθμίστε και τις Εξαιρούμενες Ομάδες (π.χ., για Λογαριασμούς υποστήριξης)\n- Προαιρετικά, ενεργοποιήστε το Ενέργειες Σύνδεσης, όπου θα επιβληθεί η συμμετοχή σε συγκεκριμένες ομάδες σε κάθε σύνδεση.\n\n## Σύγκριση με παρόμοιες εφαρμογές\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): Η εφαρμογή \"Everyone Group\" δημιουργεί μια εικονική ομάδα, προσθέτοντας όλους τους χρήστες. Αντίθετα, το \"Auto Groups\" λειτουργεί σε \"πραγματικές\" ομάδες. Επιπλέον, είναι δυνατό να προσδιορίσετε Εξαιρούμενες Ομάδες που θα αποτρέψουν την προσθήκη χρηστών στις Αυτόματες.\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): Οι \"Αυτόματες Ομάδες\" είναι στην πραγματικότητα ένα εκσυγχρονισμένο σύστημα της \"Προεπιλεγμένης Ομάδας\", το οποίο φαίνεται να έχει εγκαταλειφθεί από το NC12. Όσον αφορά τη λειτουργικότητα, είναι σχεδόν πανομοιότυπες.\n\nΕπιπλέον, σκοπεύω να προσθέσω μερικές περισσότερες λειτουργίες με την πάροδο του χρόνου, π.χ. \"Union Groups\" - δείτε το  [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) για περισσότερες λεπτομέρειες.",
    "Automatically add all users to these groups." : "Αυτόματη προσθήκη όλων των χρηστών στις ομάδες.",
    "Override Groups:" : "Εξαιρούμενες ομάδες:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Οι χρήστες που είναι μέλη τουλάχιστον σε μια από αυτές τις ομάδες εξαιρούνται από τις αυτόματες ομάδες. Αυτό ισχύει επίσης εάν ο χρήστης προστεθεί σε μία από αυτές μετά τη δημιουργία, δηλαδή, η ιδιότητα μέλους ελέγχεται μετά από κάθε τροποποίηση.",
    "Check for correct Auto Group membership on every login." : "Έλεγχος σωστής προσθήκης αυτόματης ομάδας σε κάθε σύνδεση.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Ενεργοποιήστε για να επιβάλλετε τη σωστή ιδιότητα μέλους στην αυτόματη ομάδα σε κάθε σύνδεση. Αυτό είναι χρήσιμο εάν είτε οι χρήστες δεν έχουν δημιουργηθεί στο Nextcloud (π.χ. με εξωτερικά backend χρήστη) είτε για την επιβολή της σωστής ιδιότητας μέλους για όλους τους χρήστες όταν έχουν αλλάξει οι Ομάδες Auto / Override Groups."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}