{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "El grupo \"%1$s\" se utiliza en la app Grupos Automáticos y no se puede eliminar.",
    "Auto Groups" : "Grupos Automáticos",
    "Automatically adds all users to one or multiple specified groups." : "Añade automáticamente todos los usuarios a uno o varios grupos especificados.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Añade automáticamente usuarios a los grupos automáticos especificados, excepto aquellos usuarios que pertenezcan a uno de los grupos exentos especificados.\nOpcionalmente, la asignación de grupos se puede ejecutar con cada login exitoso, lo que es útil para motores de usuario externos.\n\n## Configuración\n\n- Ve a «Configuración > Administración > Configuración adicional»\n- Configura los grupos automáticos\n- Si hace falta, configura los grupos exentos (p. ej., para cuentas de servicio)\n- Opcionalmente, activa el hook de login, que vigilará las membresías correctas en cada login exitoso\n\nNota: esta app evita el borrado de grupos referenciados como grupos automáticos o de anulación.\n\n## Comparación con apps similares\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): El «grupo Todos» añade un motor de grupos virtuales que siempre devuelve todos los usuarios. En contraste, la app «Grupos automáticos» opera en grupos reales en tu motor de grupos normales. Además, se pueden especificar reglas de excepción que evitarán que ciertos usuario se añadan al grupo (o grupos) automáticos.\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): «Grupos automáticos» es en realidad una bifurcación modenrizada y mantenida de «Grupo por defecto», que parece estar abandonada desde NC12 más o menos. En términos de funcionalidad, son casi idénticas.\n\nAdemás, planeo añadir algunas características más, p. ej. «grupos de unión» (véase los [planes](https://github.com/stjosh/auto_groups/milestones) para más detalles.",
    "Auto Groups:" : "Grupos Automáticos:",
    "Automatically add all users to these groups." : "Añade automáticamente todos los usuarios a estos grupos.",
    "Override Groups:" : "Grupos exentos:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Los usuarios que son miembros al menos de uno de estos grupos son eliminados de los grupos automáticos. Este es también el caso si el usuario se añade a uno de estos grupos después de su creación, es decir, ser miembro de estos grupos se comprueba tras cada modificación de los grupos.",
    "Check for correct Auto Group membership on every login." : "Comprueba si se pertenece a los grupos automáticos en cada inicio de sesión.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Activa esta configuración para asegurar ser miembro de grupos de manera correcta en cada inicio de sesión. Esto es útil tanto si los usuarios no se crean en Nextcloud (es decir, con motores de usuario externos) o para asegurar que la afiliación son correctas para todos los usuarios cuando los grupos automáticos o grupos exentos han cambiado.",
    "Only check for Auto Group membership on user creation." : "Sólo comprobar la pertenencia a un grupo automático en la creación de un usuario.",
    "If checked, Auto Group membership will not be re-enforced on subsequent user modifications." : "Si se marca, la pertenencia a un grupo automático no se volverá a forzar en las siguientes modificaciones del usuario."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}