{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "El grupo \"%1$s\" se utiliza en la aplicación Grupos Automáticos y no se puede eliminar.",
    "Auto Groups" : "Grupos Automáticos",
    "Automatically adds all users to one or multiple specified groups." : "Agrega automáticamente a todos los usuarios a uno o varios grupos especificados.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Settings > Administration > Additional settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Agrega automáticamente a los usuarios a los grupos automáticos especificados, excepto aquellos usuarios que pertenezcan a alguno de los grupos de anulación especificados.\n      Opcionalmente, la asignación de grupo se puede activar en cada inicio de sesión exitoso, lo cual es útil para los servicios de usuario externos.\n      \n      ## Configuración\n      \n      - Ve a \"Configuración > Administración > Configuración adicional\"\n      - Configura los Grupos Automáticos\n      - Si es necesario, configura los Grupos de Anulación (por ejemplo, para cuentas de servicio)\n      - Opcionalmente, activa el Gancho de Inicio de Sesión, que garantizará la pertenencia correcta a los grupos en cada inicio de sesión exitoso\n      \n      Ten en cuenta que esta aplicación evita la eliminación de grupos que están referenciados como Grupos Automáticos o Grupos de Anulación.\n      \n      ## Comparación con aplicaciones similares\n      \n      * [Grupo Todos](https://apps.nextcloud.com/apps/group_everyone): La aplicación \"Grupo Todos\" agrega un Backend de Grupo virtual que siempre devuelve todos los usuarios. En cambio, \"Grupos Automáticos\" opera en grupos \"reales\" en tu Backend de Grupo normal. Además, es posible especificar Grupos de Anulación que evitarán que los usuarios sean agregados a los Grupos Automáticos.\n      * [Grupo Predeterminado](https://apps.nextcloud.com/apps/defaultgroup): \"Grupos Automáticos\" es en realidad un fork modernizado y mantenido de \"Grupo Predeterminado\", que parece haber sido abandonado desde NC12 o algo así. En términos de funcionalidad, son casi idénticos.\n      \n      Además, tengo planes de agregar más características con el tiempo, como \"Grupos de Unión\" - consulta los [Planes de Etapas](https://github.com/stjosh/auto_groups/milestones) para más detalles.",
    "Automatically add all users to these groups." : "Agregar automáticamente a todos los usuarios a estos grupos.",
    "Override Groups:" : "Grupos de Anulación:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Los usuarios que son miembros de al menos uno de estos grupos se eliminan de los grupos automáticos. Esto también sucede si el usuario se agrega a uno de estos grupos después de su creación, es decir, la pertenencia a los grupos de anulación se verifica después de cada modificación de grupo.",
    "Set Auto Group membership on user creation." : "Establecer la pertenencia al Grupo Automático al crear un usuario.",
    "If checked, Auto Group membership will be enforced on user creation." : "Si está marcado, la pertenencia al Grupo Automático se aplicará al crear un usuario.",
    "Check Auto Group membership on modification of a user's groups." : "Verificar la pertenencia al Grupo Automático al modificar los grupos de un usuario.",
    "If checked, Auto Group membership will be re-enforced for a user account every time it is added to or removed from a group." : "Si está marcado, la pertenencia al Grupo Automático se volverá a aplicar para una cuenta de usuario cada vez que se agregue o elimine de un grupo.",
    "Check for correct Auto Group membership on every login." : "Verificar la pertenencia correcta al Grupo Automático en cada inicio de sesión.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Activa esta configuración para garantizar la pertenencia correcta al Grupo Automático en cada inicio de sesión exitoso. Esto es útil si los usuarios no se crean en Nextcloud (por ejemplo, con servicios de usuario externos) o para garantizar la pertenencia correcta al grupo para todos los usuarios cuando los Grupos Automáticos/Grupos de Anulación hayan cambiado."
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}