{ "translations": {
    "Auto Groups" : "Talde automatikoak",
    "Automatically adds all users to one or multiple specified groups." : "Automatikoki gehitzen ditu erabiltzaile guztiak hautaturiko talde batera edo batzuetara.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. This approach, however, has some drawbacks, e.g., that [newly added users can't see files shared with the Everyone group before the user was created](https://github.com/icewind1991/group_everyone/issues/16). In contrast to \"Everyone Group\", the \"Auto Groups\" app operates on real groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): The \"Default Group\" app has actually been the base for \"Auto Groups\". However, there are a few distinctions, most notably that \"Auto Groups\" removes users from the Auto Groups in case they are added to one of the Override Groups later on. Futhermore, \"Default Groups\" has not been updated for some time and is officially not supporting NC13 and above. In contrast, \"Auto Groups\" features community-powered translations, automated tests and is not using the deprecated Hook mechanism anymore." : "Gehitu erabiltzaileak automatikoki nahi duzun Talde Automatikoetara, kanpoan utziz Gainidazpen-talde batean dauden erabiltzaileak\nAukeran, taldeen esleipena saio-hasiera bakoitzean abiarazi daiteke, baliagarri dena erabiltzaileek kanpoko-atzealdea dutenean.\n\n## Konfigurazioa\n\n- Joan hona: \"Administratzaile ezarpenak > Ezarpen gehiago\"\n- Konfiguratu talde automatikoak\n- Beharrez gero, konfiguratu gainidazpen-taldeak (adibidez, zerbitzu-kontuentzat)\n- Aukeran, gaitu saio-hasiera kakoa, saio-hasiera bakoitzean taldeetako kidetzak zuzentzera behartuko duena.\n\n## Antzeko aplikazioen konparaketa\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): \"Guztion taldea\" aplikazioak talde-atzealde birtual bat gehitzen du, etengabe erabiltzaile guztiengana itzuliz. Lan modu honek, ordea, eragozpen batzuk dauzka, esaterako [newly added users can't see files shared with the Everyone group before the user was created](https://github.com/icewind1991/group_everyone/issues/16). \"Guztion taldea\" aplikazioak ez bezala, \"Talde automatikoak\" aplikazioak benetako taldeekin lan egiten du, zure talde-atzealde arruntean. Gainera, aukera dago gainidazpen-taldeak zehazteko, erabiltzaile batzuk talde automatikoetara gehi daitezen saihestuz.\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Talde lehenetsia\" aplikazioa oinarrizkoa izan da \"Talde automatikoak\" sortzeko. Hala ere, badira desberdintasun batzuk. Batez ere \"Talde automatikoak\" aplikazioak erabiltzaileak kentzen dituela taldetik, gainidazpen-talde batera gehituak izan direnetik aurrera. Gainera, \"Talde lehenetsiak\" eguneratu gabe dago azkenaldian eta ofizialki ez du euskarririk NC13 eta hurrengoetarako. Aitzitik, \"Talde automatikoak\" aplikazioan komunitateak bultzatutako itzulpenak daude, test automatizatuak ere bai eta ez du erabiltzen baztertuta geratu zen kako mekanismoa.",
    "Auto Groups:" : "Talde automatikoak:",
    "Automatically add all users to these groups." : "Gehitu automatikoki erabiltzaile guztiak talde hauetara.",
    "Override Groups:" : "Gainidazpen taldeak:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Talde hauetakoren batean dauden erabiltzaileak kendu egiten dira talde automatikoetatik. Hala gertatzen da, baita ere, erabiltzaile bat taldea sortu ondoren gehitzen bada. Esaterako, gainidazpen-taldeetako kidetzak berrikusi egiten dira taldeetan aldaketak egiten diren bakoitzean.",
    "Check for correct Auto Group membership on every login." : "Egiaztatu beti Talde Automatikoaren kidetza saioa hastean",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Gaitu ezarpen hau talde automatikoen kidetzak saio-hasiera bakoitzean ondo berrezartzeko. Hau erabilgarria da bai erabiltzaileak Nextclouden sortuak ez badira (adib. kanpoko-atzealdea dutenean) eta bai talde automatikoek edo gainidazpen-taldeek aldaketak jasan dituztenean,  erabiltzaile guztien talde kidetzak ondo berrezartzeko."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}