{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "O grupo «%1$s» úsase na aplicación «Grupos automáticos» e non é posíbel eliminalo.",
    "Auto Groups" : "Grupos automáticos",
    "Automatically adds all users to one or multiple specified groups." : "Engade automaticamente todos os usuarios a un ou varios grupos especificados.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Settings > Administration > Additional settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Engadir automaticamente usuarios aos grupos automáticos especificados, agás os que pertencen a un dos grupos de substitución especificados.\nOpcionalmente, a asignación de grupo pódese activar en cada acceso correcto, o que é útil para as infraestruturas de usuarios externos.\n\n## Configuración\n\n– Vaia a «Axustes > Administración > Axustes adicionais»\n– Configure os grupos automáticos\n– Se é preciso, configure os grupos de substitución (por exemplo, para as contas de servizo)\n– Opcionalmente, active o enganche de acceso, que imporá a pertenza correcta ao grupo en cada acceso correcto\n\nTeña en conta que esta aplicación impide eliminar os grupos para o caso dos grupos aos que se fai referencia como Grupos automáticos ou Grupos de substitución.\n\n## Comparación con aplicacións semellantes\n\n* [Grupo de todos](https://apps.nextcloud.com/apps/group_everyone): A aplicación «Grupo de todos» engade unha infraestrutura de grupo virtual, devolvendo sempre a todos os usuarios. Porén, «Grupos automáticos» funciona en grupos «reais» na súa infraestrutura de grupo normal. Ademais, é posíbel especificar grupos de substitución que evitarán que os usuarios sexan engadidos aos grupos automáticos.\n* [Grupo predeterminado](https://apps.nextcloud.com/apps/defaultgroup): «Grupos automáticos» en realidade é unha bifurcación de «Grupo predeterminado», que parece estar abandonada dende NC12 máis ou menos. En termos de funcionalidade, son case idénticos.\n\nAdemais, teño pensado engadir máis funcións co paso do tempo, por exemplo, «Grupos de unión» (consulte a [Planificación de fitos](https://github.com/stjosh/auto_groups/milestones) para máis detalles.",
    "Automatically add all users to these groups." : "Engade automaticamente todos os usuarios a estes grupos.",
    "Override Groups:" : "Grupos de substitución:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Os usuarios que son membros de polo menos un destes grupos son retirados dos grupos automáticos. Este é o caso tamén se o usuario se engade a un destes grupos após a creación, é dicir, a pertenza aos grupos de substitución compróbase após cada modificación do grupo.",
    "Set Auto Group membership on user creation." : "Estabelecer a pertenza ao grupo automático na creación de usuarios.",
    "If checked, Auto Group membership will be enforced on user creation." : "Se está marcada, a pertenza ao grupo automático aplicarase na creación do usuario.",
    "Check Auto Group membership on modification of a user's groups." : "Comprobe a pertenza ao grupo automático na modificación dos grupos dun usuario.",
    "If checked, Auto Group membership will be re-enforced for a user account every time it is added to or removed from a group." : "Se está marcada, a pertenza ao grupo automático volverase impor para unha conta de usuario cada vez que se engada ou retire dun grupo.",
    "Check for correct Auto Group membership on every login." : "Comprobar a pertenza correcta ao grupo automático en cada acceso.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Active este axuste para impor a pertenza correcta ao grupo automático en cada acceso satisfactorio. Isto é útil se calquera dos usuarios non se crea en Nextcloud (por exemplo, con infraestruturas de usuarios externos) ou para facer cumprir a pertenza a un grupo correcto para todos os usuarios cando os grupos automáticos / grupos de substitución cambiaron."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}