{ "translations": {
    "Auto Groups" : "Grupos automáticos",
    "Automatically adds all users to one or multiple specified groups." : "Engade automaticamente todos os usuarios a un ou varios grupos especificados.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login" : "Engada automaticamente os usuarios aos grupos automáticos especificados, agás os que pertencen a un dos grupos de anulación especificados. Opcionalmente, a asignación de grupo pódese activar en cada acceso correcto, o que é útil para as copias de seguridade de usuarios externos.\n\n## Configuración\n\n— Vaia a «Axustes do administrador > Axustes adicionais»\n— Configure os grupos automáticos\n— Se é necesario, configure os grupos de anulación (por exemplo, para as contas de servizo)\n— Opcionalmente, active o Gancho de acceso, que forzará a adhesión pertenza ao grupo a cada acceso correcto",
    "Auto Groups:" : "Grupos automáticos:",
    "Automatically add all users to these groups." : "Engade automaticamente todos os usuarios a estes grupos.",
    "Override Groups:" : "Grupos de anulación:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Os usuarios que son membros de polo menos un destes grupos son eliminados dos grupos automáticos. Este é o caso tamén se o usuario se engade a un destes grupos despois da creación, é dicir, a pertenza aos grupos de anulación compróbase despois de cada modificación do grupo.",
    "Check for correct Auto Group membership on every login." : "Comprobar a pertenza correcta ao grupo automático en cada inicio de sesión.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Active este axuste para forzar a pertenza axeitada ao grupo automático en cada acceso correcto. Isto é útil se calquera dos usuarios non se crean en Nextcloud (por exemplo, con copias de seguridade de usuarios externos) ou para facer cumprir a pertenza a un grupo correcto para todos os usuarios cando os grupos automáticos / grupos de anulación cambiaron."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}