{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "グループ\"%1$s\"はオートグループアプリで使用中のため消去できません。",
    "Auto Groups" : "オートグループ",
    "Automatically adds all users to one or multiple specified groups." : "すべてのユーザーを1つまたは複数の指定されたグループに自動的に追加します。",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "指定された自動グループにユーザーを自動的に追加します。ただし、指定されたオーバーライドグループの1つに属するユーザーは除きます。\nオプションで、ログインが成功するたびにグループ割り当てをトリガーできます。これは、外部ユーザーバックエンドに役立ちます。\n\n## 設定\n- 「管理者設定」> 「追加設定」に移動します。\n- 自動グループを設定します。\n- 必要に応じて、オーバーライドグループ(サービスアカウント用など)を構成します。\n- オプションで、ログインフックを有効にします。これにより、ログインが成功するたびに正しいグループメンバーシップが適用されます。\n\nこのアプリは、自動グループまたはオーバーライドグループとして参照されているグループのグループ削除を妨げることに留意してください。\n\n## 類似アプリとの比較\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone)：「Everyone Group」アプリは常にすべてのユーザーを返す仮想グループバックエンドを追加ます。対照的に、「オートグループ」は通常のグループバックエンドの「実際の」グループで動作します。さらに、自動グループにユーザーが追加されないようにするオーバーライドグループを指定することもできます。\n* [デフォルトグループ](https://apps.nextcloud.com/apps/defaultgroup)： 「オートグループ」は実際には、「デフォルトグループ」の最新化されたメインテナンスフォークです。「デフォルトグループ」はNC12以降に廃止されたようです。機能的に両者はほぼ同じです。\n\nさらに、「ユニオングループ」などの機能を徐々に追加する予定です。詳細については[マイルストーン計画](https://github.com/stjosh/auto_groups/milestones)を参照してください。",
    "Automatically add all users to these groups." : "全ユーザーを自動的にこれらのグループに追加します。",
    "Override Groups:" : "オーバーライドグループ：",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "これらのグループの少なくとも1つに所属しているユーザーはオートグループから取り除かれます。ユーザーが作成後にこれらのグループの1つに追加された場合もこれに該当します。つまり、グループ変更のたびにオーバーライドグループのメンバーシップがチェックされます。",
    "Check for correct Auto Group membership on every login." : "オートグループによるメンバシップの修正をログイン時毎回行なう場合はチェックしてください。",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "ログイン成功時に毎回、適切なオートグループのメンバシップを強制的に設定するには、この設定を有効化してください。ユーザーがNextcloudで作成されたものでない場合（たとえば外部のユーザーバックエンドで作成された場合など）や、オートグループやオーバーライドグループが変更された場合に、強制的にグループのメンバシップを修正するのに役立ちます。"
},"pluralForm" :"nplurals=1; plural=0;"
}