{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Gruppen \"%1$s\" brukes i Auto Groups-appen og kan ikke slettes.",
    "Auto Groups" : "Automatiske grupper",
    "Automatically adds all users to one or multiple specified groups." : "Legger automatisk til alle brukere i en eller flere spesifiserte grupper.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Settings > Administration > Additional settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Legg automatisk til brukere i de spesifiserte automatiske gruppene, bortsett fra de brukerne som tilhører en av de angitte overstyringsgruppene.\nEventuelt kan gruppetildelingen utløses ved hver vellykket pålogging, noe som er nyttig for eksterne brukere.\n\n## Konfigurasjon\n\n- Gå til \"Innstillinger > Administrasjon > Tilleggsinnstillinger\"\n- Konfigurer Auto Groups\n- Konfigurer om nødvendig overstyringsgruppene (f.eks. for tjenestekontoer)\n- Aktiver eventuelt påloggingskroken, som vil fremtvinge korrekt gruppemedlemskap ved hver vellykket pålogging\n\nMerk at denne appen forhindrer gruppesletting for grupper referert til som automatiske grupper eller overstyre grupper.\n\n## Sammenligning med lignende apper\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): «Everyone Group»-appen legger til en virtuell gruppestøtte, og returnerer alltid alle brukere. I motsetning til dette, opererer \"Auto Groups\" på \"ekte\" grupper i din vanlige Group Backend. I tillegg er det mulig å spesifisere overstyringsgrupper som vil forhindre at brukere blir lagt til i autogruppen(e).\n* [Standardgruppe](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" er faktisk en modernisert og vedlikeholdt fork av \"Default Group\", som ser ut til å være forlatt siden NC12 eller så. Når det gjelder funksjonalitet, er de nesten identiske.\n\nI tillegg planlegger jeg å legge til noen flere funksjoner over tid, f.eks. \"Union Groups\" - se [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for flere detaljer.",
    "Automatically add all users to these groups." : "Legg automatisk til alle brukere i disse gruppene.",
    "Override Groups:" : "Overstyr grupper:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Brukere som er medlem av minst én av disse gruppene fjernes fra autogruppene. Dette er også tilfelle hvis brukeren legges til i en av disse gruppene etter opprettelse, dvs. medlemskap i overstyringsgruppene kontrolleres etter hver gruppeendring.",
    "Set Auto Group membership on user creation." : "Angi automatisk gruppemedlemskap ved brukeroppretting.",
    "If checked, Auto Group membership will be enforced on user creation." : "Hvis det er merket av for, vil automatisk gruppemedlemskap bli håndhevet når brukeren opprettes.",
    "Check Auto Group membership on modification of a user's groups." : "Sjekk Auto Group-medlemskap ved endring av en brukers grupper.",
    "If checked, Auto Group membership will be re-enforced for a user account every time it is added to or removed from a group." : "Hvis det er merket av for, vil automatisk gruppemedlemskap bli gjenopprettet for en brukerkonto hver gang den legges til eller fjernes fra en gruppe.",
    "Check for correct Auto Group membership on every login." : "Se etter riktig Auto Group-medlemskap ved hver pålogging.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Aktiver denne innstillingen for å fremtvinge riktig Auto Group-medlemskap ved hver vellykket pålogging. Dette er nyttig hvis brukere enten ikke er opprettet i Nextcloud (f.eks. med eksterne brukerstøtter) eller for å fremtvinge riktig gruppemedlemskap for alle brukere når de automatiske gruppene/overstyringsgruppene har endret seg."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}