{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Groep \"%1$s\" wordt gebruikt in de Auto Groups App en kan niet worden verwijderd.",
    "Auto Groups" : "Auto Groepen",
    "Automatically adds all users to one or multiple specified groups." : "Voeg alle gebruikers automatisch toe aan een of meer van de aangegeven groepen.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Voeg automatisch gebruikers toe aan de opgegeven Auto Groepen, behalve de gebruikers die behoren tot een van de opgegeven Overschrijf Groepen. Optioneel kan de groepstoewijzing worden geactiveerd bij elke succesvolle login, wat handig is voor backends van externe gebruikers.\n\n## Configuratie\n\n- Ga naar \"Beheerinstellingen> Aanvullende instellingen\"\n- Configureer de Auto Groepen\n- Configureer indien nodig de Negeer Groepen (bijv. Voor Serviceaccounts)\n- Optioneel, schakel de Login Hook in, die een correct groepslidmaatschap zal afdwingen bij elke succesvolle login\n\n## Vergelijking met vergelijkbare apps\n\n* [Everyone Group] (https://apps.nextcloud.com/apps/group_everyone): De app \"Everyone Group\" voegt een virtuele Groep Backend toe, waarbij altijd alle gebruikers worden terug gemeld. In tegenstelling tot \"Everyone Group\", werkt de app \"Auto Groepen\" op echte groepen in je normale Groep Backend. Bovendien is het mogelijk om Overschrijf Groepen op te geven om te voorkomen dat gebruikers aan de Auto Group (s) worden toegevoegd\n* [Default Group] (https://apps.nextcloud.com/apps/defaultgroup): De \"Default Group\" -app was eigenlijk de basis voor \"Auto Groepen\". die sinds NC12 niet meer is bijgewerkt. Functioneel zijn ze vrijwel identiek.\n\nIk ben van plan om binnenkort meer functionaliteit toe te voegen, zoals \"Union Groups\" - zie [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) voor meer details.",
    "Automatically add all users to these groups." : "Voeg gebruikers automatisch toe aan deze groepen.",
    "Override Groups:" : "Overschrijf Groepen::",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Gebruikers die lid zijn van ten minste een van deze groepen worden verwijderd uit de autogroepen. Dit is ook het geval als de gebruiker na het aanmaken aan een van deze groepen wordt toegevoegd, d.w.z. het lidmaatschap van de vervangende groepen wordt gecontroleerd na elke groepswijziging.",
    "Check for correct Auto Group membership on every login." : "Aankruisen voor juiste Auto Groep lidmaatschap bij iedere login.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Schakel deze instelling in om het juiste Auto Groepslidmaatschap af te dwingen bij elke succesvolle login. Dit is handig als gebruikers niet zijn gemaakt in Nextcloud (bijv. Met externe gebruikersbackends) of om een correct groepslidmaatschap voor alle gebruikers af te dwingen wanneer  Auto Groepen / Overschrijf Groepen zijn gewijzigd."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}