{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Группа «%1$s» не может быть удалена, так как используется в приложении «Автогруппы»",
    "Auto Groups" : "Автогруппы",
    "Automatically adds all users to one or multiple specified groups." : "Автоматическое добавление всех пользователей в одну или несколько заданных групп",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Автоматически добавлять пользователей в указанные автоматически группы, кроме тех пользователей, которые принадлежат к одной из указанных групп переопределения.\nПри желании групповое назначение может запускаться при каждом успешном входе в систему, что полезно для внешних пользовательских бэкэндов.\n\n##Конфигурация\n\n- Перейдите в «Настройки администратора> Дополнительные настройки»\n- настроить авто группы\n- При необходимости настройте группы переопределения (например, для учетных записей служб).\n- При желании включите Хук входа в систему, который обеспечит правильное членство в группе при каждом успешном входе в систему.\n\nОбратите внимание, что это приложение предотвращает удаление групп для групп, на которые ссылаются как на Автоматические группы или Группы переопределения.\n\n##Сравнение с похожими приложениями\n\n* [Все группы] (https://apps.nextcloud.com/apps/group_everyone): приложение «Все группы» добавляет виртуальный бэкэнд группы, всегда возвращая всех пользователей. Напротив, «Авто группы» работают с «настоящими» группами в обычном групповом бэкэнде. Кроме того, можно указать группы переопределения, которые будут препятствовать добавлению пользователей в автоматические группы.\n* [Группа по умолчанию] (https://apps.nextcloud.com/apps/defaultgroup): «Автоматические группы» на самом деле представляют собой модернизированный и обслуживаемый форк «Группы по умолчанию», который, похоже, был заброшен начиная с NC12 или около того. По функциональности они практически идентичны.\n\nКроме того, я планирую добавить со временем некоторые дополнительные функции, например, «Объединенные группы» - для получения дополнительной информации см. [Планы промежуточных этапов] (https://github.com/stjosh/auto_groups/milestones).",
    "Automatically add all users to these groups." : "Автоматически добавлять всех пользователей в эти группы",
    "Override Groups:" : "Переопределяющие группы:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Пользователи, входящие хотя бы в одну из перечисленных групп, будут удалены их автогрупп. Удаление из автогрупп будет выполнено также в случае, если пользователь был добавлен в эти группы после их создания. Участие пользователя в группах из списка переопределяющих групп проверяется после каждого изменения таких групп. ",
    "Check for correct Auto Group membership on every login." : "Проверять принадлежность пользователя автогруппе при каждом входе в систему",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "При включении этого параметра будет проверяться действительность принадлежности пользователя автогруппе при его каждом успешном  входе в систему. Такое поведение полезно в случае, когда учётные записи пользователей создаются вне Nextcloud (к примеру, при использовании механизмов поддержки внешнего управления пользователями) или для принудительного изменения участия пользователей в группах при изменении списка автоматически назначаемых или  переопределяющих групп."
},"pluralForm" :"nplurals=4; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<12 || n%100>14) ? 1 : n%10==0 || (n%10>=5 && n%10<=9) || (n%100>=11 && n%100<=14)? 2 : 3);"
}