{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Группа «%1$s» не может быть удалена, так как используется в приложении Автогруппы",
    "Auto Groups" : "Автогруппы",
    "Automatically adds all users to one or multiple specified groups." : "Автоматическое добавление всех пользователей в одну или несколько заданных групп",
    "Auto Groups:" : "Автогруппы:",
    "Automatically add all users to these groups." : "Автоматически добавлять всех пользователей в эти группы",
    "Override Groups:" : "Переопределяющие группы:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Пользователи, входящие хотя бы в одну из перечисленных групп, будут удалены их автогрупп. Удаление из автогрупп будет выполнено также в случае, если пользователь был добавлен в эти группы после их создания. Участие пользователя в группах из списка переопределяющих групп проверяется после каждого изменения таких групп. ",
    "Check for correct Auto Group membership on every login." : "Проверять принадлежность пользователя автогруппе при каждом входе в систему",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "При включении этого параметра будет проверяться действительность принадлежности пользователя автогруппе при его каждом успешном  входе в систему. Такое поведение полезно в случае, когда учётные записи пользователей создаются вне Nextcloud (к примеру, при использовании механизмов поддержки внешнего управления пользователями) или для принудительного изменения участия пользователей в группах при изменении списка автоматически назначаемых или  переопределяющих групп."
},"pluralForm" :"nplurals=4; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<12 || n%100>14) ? 1 : n%10==0 || (n%10>=5 && n%10<=9) || (n%100>=11 && n%100<=14)? 2 : 3);"
}