{ "translations": {
    "Auto Groups" : "Automatické skupiny",
    "Automatically adds all users to one or multiple specified groups." : "Automaticky pridá všetkých používateľov do jednej alebo viacerých určených skupín.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. This approach, however, has some drawbacks, e.g., that [newly added users can't see files shared with the Everyone group before the user was created](https://github.com/icewind1991/group_everyone/issues/16). In contrast to \"Everyone Group\", the \"Auto Groups\" app operates on real groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): The \"Default Group\" app has actually been the base for \"Auto Groups\". However, there are a few distinctions, most notably that \"Auto Groups\" removes users from the Auto Groups in case they are added to one of the Override Groups later on. Futhermore, \"Default Groups\" has not been updated for some time and is officially not supporting NC13 and above. In contrast, \"Auto Groups\" features community-powered translations, automated tests and is not using the deprecated Hook mechanism anymore." : "Automatické pridávanie používateľov do zadaných automatických skupín, s výnimkou používateľov, ktorí patria do jednej nebo viacerých prepisujúcich skupín.\nPriradenie skupiny je možné spustiť pri každom úspešnom prihlásení, čo je užitočné pre serverové aplikácie externých používateľov.\n\n## Nastavenie\n\n- Prejdite na „Nastavenia správcu > Ďalšie nastavenia“\n- Nastavte automatické skupiny\n- Ak je to potrebné, nastavte prepisujúce skupiny (napr. pre služby účtov).\n- Voliteľne povoľte prihlasovací háčik, ktorý pri každom úspešnom prihlásení vynúti správne členstvo v skupine\n\n## Porovnanie s podobnými aplikáciami\n\n* [Skupina Všetci](https://apps.nextcloud.com/apps/group_everyone): Aplikácia „Skupina Všetci“ pridáva podporu virtuálnej skupiny, ktorá vracia všetkých používateľov. Tento prístup má však určité nevýhody, napríklad, že [novo pridaní používatelia nevidia súbory, zdieľané so skupinou Všetci skôr, ako bol používateľ vytvorený](https://github.com/icewind1991/group_everyone/issues/16). Oproti „Skupina Všetci“ aplikácia „Automatické skupiny“ funguje so skutočnými skupinami v normálnom prostredí riadenia skupín. Ďalej je možné určiť prepisujúce skupiny, ktoré zabránia používateľom pridať sa do automatických skupín.\n\n* [Predvolená skupina](https://apps.nextcloud.com/apps/defaultgroup): Aplikácia „Predvolená skupina“ poslúžila ako základ pre „Automatické skupiny“. Existuje však niekoľko rozdielov, najmä to, že „Automatické skupiny“ odstránia používateľov z automatických skupín v prípade, že budú neskôr pridaní do jednej z prepisujúcich skupín. „Predvolené skupiny“ sa už nejaký čas neaktualizovali a oficiálne nie sú podporované od NC13. Naopak, „Automatické skupiny“ obsahujú preklady od komunity, automatizovanými testami a nepoužívajú už zastaraný mechanizmus zaháčknutia.",
    "Auto Groups:" : "Automatické skupiny:",
    "Automatically add all users to these groups." : "Automaticky pridávať všetkých používateľov do týchto skupín.",
    "Override Groups:" : "Prepisujúce skupiny:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Používatelia, ktorí sú členmi aspoň jednej z týchto skupín, sú odstránení z automatických skupín. To je tiež prípad, keď je užívateľ pridaný do jednej z týchto skupín po vytvorení, t.j. členstvo v prepisujúcich skupinách sa kontroluje po každej zmene skupiny.",
    "Check for correct Auto Group membership on every login." : "Kontrolovať správnosť členstva v automatických skupinách pri každom prihlásení.",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Povoľte toto nastavenie, aby ste pri každom úspešnom prihlásení vynútili správne členstvo v automatickej skupine. Toto je užitočné, ak nie je používateľ vytvorený v Nextcloud (napr. prípade používateľov z externých systémov), alebo pre vynútenie správneho členstva v skupinách pre všetkých používateľov, keď sa zmenili automatické/prepisujúce skupiny."
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n == 1 ? 0 : n % 1 == 0 && n >= 2 && n <= 4 ? 1 : n % 1 != 0 ? 2: 3);"
}