{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "Skupino »%1$s« uporablja program za ustvarjanje samodejnih skupin in je ni mogoče izbrisati.",
    "Auto Groups" : "Samodejne skupine",
    "Automatically adds all users to one or multiple specified groups." : "Samodejno dodajanje vseh uporabnikov v eno ali več določenih skupin.",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "Samodejno dodajanje uporabnikov v izbrane skupine, z izjemo tistih, ki pripadajo eni od posebnih skupin.\nIzbirno je mogoče določiti dodeljevanje v skupine ob vsaki uspešni prijavi, kar je koristno pri uporabi zunanjih uporabniških vmesnikov.\n\n## Nastavitve\n\n- Možnosti so zbrane med »Nastavitvami skrbnika > Dodatne nastavitve«\n- Ustvariti in prilagoditi je treba določila samodejnih skupin\n- Ustvariti je mogoče tudi posebne skupine za preglasitev (npr. za storitvene račune)\n- Priporočljivo je omogočiti tudi spletne povezave za prijavo, ki zagotavlja pravilno članstvo skupin ob vsaki uspešni prijavi\n\nProgram preprečuje brisanje skupin, na katere se sklicuje, torej za vse Samodejne in posebne skupine.\n\n## Primerjava s podobnimi programi\n\n* [Skupna skupina](https://apps.nextcloud.com/apps/group_everyone): program »Skupna skupina« doda sklic na ozadnji program, ki vrne seznam vseh uporabnikov. Nasprotno pa program »Samodejne skupine« deluje na »pravih« skupinah ozadnjega programa. Ob tem je mogoče določiti tudi posebne skupine, ki razveljavijo dodajanje v samodejne skupine.\n* [Privzeta skupina](https://apps.nextcloud.com/apps/defaultgroup): program »Samodejne skupine« je pravzaprav posodobljena razvejitev programa \"Privzeta skupina\", ki kaže, da je opuščen že od različice NC12. Po načinu delovanja sta programa skoraj enaka.\n\nV prihodnje so načrtovane dodate zmožnosti, ko je »Združene skupine« – za več podrobnosti si oglejte [Načrtovanje mejnikov](https://github.com/stjosh/auto_groups/milestones)",
    "Automatically add all users to these groups." : "Samodejno dodaj vse uporabnike v te skupine.",
    "Override Groups:" : "Prepisne skupine:",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "Uporabniki, ki so člani vsaj ene od navedenih skupin, so odstranjeni iz seznama samodejnih skupin. To velja tudi za uporabnike, ki so dodani v eno od skupin po ustvarjanju skupine. Članstvo v teh skupinah se namreč preverja po vsaki spremembi skupine.",
    "Set Auto Group membership on user creation." : "Članstvo v samodejnih skupinah nastavi ob ustvarjanju računa uporabnika.",
    "If checked, Auto Group membership will be enforced on user creation." : "Izbrana možnost določa, da bo članstvo v samodejnih skupinah vsiljena ob ustvarjanju uporabnikovega računa.",
    "Check Auto Group membership on user modification." : "Preveri članstvo v samodejnih skupinah ob spreminjanju računa uporabnika.",
    "If checked, Auto Group membership will be re-enforced on every user modification." : "Izbrana možnost določa, da bo članstvo v samodejnih skupinah vsiljena ob vsakem spreminjanju uporabnikovega računa.",
    "Check for correct Auto Group membership on every login." : "Preveri za pravilno članstvo v samodejni skupini ob vsaki prijavi:",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "Nastavitev je pomembna za uveljavljanje članstva v Samodejni skupini pri vsaki uspešni prijavi. To je še posebej uporabno, če uporabniški račun ni ustvarjen v okolju Nextcloud, ampak z zunanjim programom (npr. s programom na pametni napravi) in zato, da je članstvo v teh skupinah vedno posodobljeno, ko se seznam uporabnikov v Samodejnih / Posebnih skupinah spremeni."
},"pluralForm" :"nplurals=4; plural=(n%100==1 ? 0 : n%100==2 ? 1 : n%100==3 || n%100==4 ? 2 : 3);"
}