{ "translations": {
    "Group \"%1$s\" is used in the Auto Groups App and cannot be deleted." : "群组”%1$s“被用于Auto Groups应用且不能被删除",
    "Auto Groups" : "自动加入群组",
    "Automatically adds all users to one or multiple specified groups." : "将所有用户自动添加到一个或者多个的指定群组",
    "Automatically add users to the specified Auto Groups, except those users belonging to one of the specified Override Groups. \nOptionally, the group assignment can be triggered on every successful login, which is useful for external user backends.\n\n## Configuration\n\n- Go to \"Admin Settings > Additional Settings\"\n- Configure the Auto Groups\n- If required, configure the Override Groups (e.g., for Service Accounts)\n- Optionally, enable the Login Hook, which will enforce correct group membership on every successful login\n\nNote that this app prevents group deletions for groups referenced as Auto Groups or Override Groups.\n\n## Comparison to similar Apps\n\n* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): The \"Everyone Group\" app adds a virtual Group Backend, always returning all users. In contrast, \"Auto Groups\" operates on \"real\" groups in your normal Group Backend. Additionally, it is possible to specify Override Groups which will prevent users from being added to the Auto Group(s).\n* [Default Group](https://apps.nextcloud.com/apps/defaultgroup): \"Auto Groups\" is actually a modernized and maintaned fork of \"Default Group\", which seems to be abandoned since NC12 or so. In terms of functionality, they are almost identical.\n\nIn addition, I plan to add some more features over time, e.g., \"Union Groups\" - see the [Milestone Plans](https://github.com/stjosh/auto_groups/milestones) for more details." : "自动将用户添加到指定的自动组，但归属于指定覆盖组之一的用户除外此外，还可以选择在每次成功登录时触发群组分配，这对于外部用户后端很有用。##配置-进入“管理设置>附加设置”-配置自动组-如有需要，配置覆盖组(例如，为服务帐户)-可选，启用登录挂钩，这将在每次成功登录时强制正确的组成员资格注意，这个应用程序防止删除作为自动组或覆盖组被引用的组#与类似应用程序的比较* [Everyone Group](https://apps.nextcloud.com/apps/group_everyone): 该应用添加一个虚拟的应用后端，始终返回全部用户。与之相反，“自动组”运作在正常群组后端的“真实”组上。此外，还可以指定阻止用户被添加到自动组中的覆盖组。* [默认组](https://apps.nextcloud.com/apps/defaultgroup): “自动组”实际上是“默认组”的一个现代化受维护的分支，它似乎自Nextcloud 12版本左右就被抛弃了。就功能而言，它们几乎是相同的。\n\n此外，我计划随着时间的推移添加更多的特性，例如“联盟组”-更多细节请查看[里程碑计划](https://github.com/stjosh/auto_groups/milestones)",
    "Auto Groups:" : "自动加入群组：",
    "Automatically add all users to these groups." : "将所有用户自动添加到这些群组",
    "Override Groups:" : "强制覆盖群组",
    "Users which are member of at least one of these groups are removed from the auto groups. This is also the case if the user is added to one of these groups after creation, i.e., membership in the override groups is checked after each group modification." : "至少属于其中一个组的用户将从自动组中删除。如果用户在创建后被添加到这些组中的一个，情况也是如此，即在每次群组修改后检查覆盖组中的成员资格。",
    "Check for correct Auto Group membership on every login." : "每次登录时检查自动加入群组成员身份是否正确",
    "Enable this setting to enforce proper Auto Group membership on every successful login. This is useful if either users are not created in Nextcloud (e.g., with external user backends) or to enforce correct group membership for all users when the Auto Groups / Override Groups have changed." : "开启这个设置将每次成功登陆时强制加入指定组中。对于未在nextcloud中创建用户的（例如：外部存储用户）或者已经强制自动加入组/覆盖组的成员他们将会被修改。"
},"pluralForm" :"nplurals=1; plural=0;"
}